---
kind: type
id: T:Autodesk.Revit.DB.Events.DocumentOpeningEventArgs
source: html/1c21b33d-1314-d096-0a36-ad59ad80c6e9.htm
---
# Autodesk.Revit.DB.Events.DocumentOpeningEventArgs

The event arguments used by the DocumentOpening event.

## Syntax (C#)
```csharp
public class DocumentOpeningEventArgs : RevitAPIPreEventArgs
```